espressif/esp-idf/components/soc/esp32h2/register/soc/cache_struct.h
/** Type of l1_cache_blocksize_conf register
 *  L1 data Cache BlockSize mode configure register
 */
typedef union {
    struct {
        /** l1_cache_blocksize_8 : HRO; bitpos: [0]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 8 bytes. This field and all
         *  other fields within this register is onehot.
         */
        uint32_t l1_cache_blocksize_8:1;
        /** l1_cache_blocksize_16 : HRO; bitpos: [1]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 16 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_blocksize_16:1;
        /** l1_cache_blocksize_32 : HRO; bitpos: [2]; default: 1;
         *  The field is used to configureblocksize of L1-DCache as 32 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_blocksize_32:1;
        /** l1_cache_blocksize_64 : HRO; bitpos: [3]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 64 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_blocksize_64:1;
        /** l1_cache_blocksize_128 : HRO; bitpos: [4]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 128 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_blocksize_128:1;
        /** l1_cache_blocksize_256 : HRO; bitpos: [5]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 256 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_cache_blocksize_256:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l1_cache_blocksize_conf_reg_t;

/** Type of l2_cache_cachesize_conf register
 *  L2 Cache CacheSize mode configure register
 */
typedef union {
    struct {
        /** l2_cache_cachesize_1k : HRO; bitpos: [0]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 1k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_1k:1;
        /** l2_cache_cachesize_2k : HRO; bitpos: [1]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 2k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_2k:1;
        /** l2_cache_cachesize_4k : HRO; bitpos: [2]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 4k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_4k:1;
        /** l2_cache_cachesize_8k : HRO; bitpos: [3]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 8k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_8k:1;
        /** l2_cache_cachesize_16k : HRO; bitpos: [4]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 16k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_16k:1;
        /** l2_cache_cachesize_32k : HRO; bitpos: [5]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 32k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_32k:1;
        /** l2_cache_cachesize_64k : HRO; bitpos: [6]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 64k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_64k:1;
        /** l2_cache_cachesize_128k : HRO; bitpos: [7]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 128k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_128k:1;
        /** l2_cache_cachesize_256k : HRO; bitpos: [8]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 256k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_256k:1;
        /** l2_cache_cachesize_512k : HRO; bitpos: [9]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 512k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_512k:1;
        /** l2_cache_cachesize_1024k : HRO; bitpos: [10]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 1024k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_1024k:1;
        /** l2_cache_cachesize_2048k : HRO; bitpos: [11]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 2048k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_2048k:1;
        /** l2_cache_cachesize_4096k : HRO; bitpos: [12]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 4096k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_cachesize_4096k:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} cache_l2_cache_cachesize_conf_reg_t;

/** Type of l2_cache_blocksize_conf register
 *  L2 Cache BlockSize mode configure register
 */
typedef union {
    struct {
        /** l2_cache_blocksize_8 : HRO; bitpos: [0]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 8 bytes. This field and all
         *  other fields within this register is onehot.
         */
        uint32_t l2_cache_blocksize_8:1;
        /** l2_cache_blocksize_16 : HRO; bitpos: [1]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 16 bytes. This field and all
         *  other fields within this register is onehot.
         */
        uint32_t l2_cache_blocksize_16:1;
        /** l2_cache_blocksize_32 : HRO; bitpos: [2]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 32 bytes. This field and all
         *  other fields within this register is onehot.
         */
        uint32_t l2_cache_blocksize_32:1;
        /** l2_cache_blocksize_64 : HRO; bitpos: [3]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 64 bytes. This field and all
         *  other fields within this register is onehot.
         */
        uint32_t l2_cache_blocksize_64:1;
        /** l2_cache_blocksize_128 : HRO; bitpos: [4]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 128 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_blocksize_128:1;
        /** l2_cache_blocksize_256 : HRO; bitpos: [5]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 256 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l2_cache_blocksize_256:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_blocksize_conf_reg_t;


/** Group: Wrap Mode Control and configuration registers */
/** Type of l1_cache_wrap_around_ctrl register
 *  Cache wrap around control register
 */
typedef union {
    struct {
        /** l1_icache0_wrap : HRO; bitpos: [0]; default: 0;
         *  Set this bit as 1 to enable L1-ICache0 wrap around mode.
         */
        uint32_t l1_icache0_wrap:1;
        /** l1_icache1_wrap : HRO; bitpos: [1]; default: 0;
         *  Set this bit as 1 to enable L1-ICache1 wrap around mode.
         */
        uint32_t l1_icache1_wrap:1;
        /** l1_icache2_wrap : HRO; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_wrap:1;
        /** l1_icache3_wrap : HRO; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_wrap:1;
        /** l1_cache_wrap : R/W; bitpos: [4]; default: 0;
         *  Set this bit as 1 to enable L1-DCache wrap around mode.
         */
        uint32_t l1_cache_wrap:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_wrap_around_ctrl_reg_t;

/** Type of l2_cache_wrap_around_ctrl register
 *  Cache wrap around control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_wrap : HRO; bitpos: [5]; default: 0;
         *  Set this bit as 1 to enable L2-Cache wrap around mode.
         */
        uint32_t l2_cache_wrap:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_wrap_around_ctrl_reg_t;


/** Group: Cache Tag Memory Power Control registers */
/** Type of l1_cache_tag_mem_power_ctrl register
 *  Cache tag memory power control register
 */
typedef union {
    struct {
        /** l1_icache0_tag_mem_force_on : HRO; bitpos: [0]; default: 1;
         *  The bit is used to close clock gating of  L1-ICache0 tag memory. 1: close gating,
         *  0: open clock gating.
         */
        uint32_t l1_icache0_tag_mem_force_on:1;
        /** l1_icache0_tag_mem_force_pd : HRO; bitpos: [1]; default: 0;
         *  The bit is used to power L1-ICache0 tag memory down. 0: follow rtc_lslp, 1: power
         *  down
         */
        uint32_t l1_icache0_tag_mem_force_pd:1;
        /** l1_icache0_tag_mem_force_pu : HRO; bitpos: [2]; default: 1;
         *  The bit is used to power L1-ICache0 tag memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l1_icache0_tag_mem_force_pu:1;
        uint32_t reserved_3:1;
        /** l1_icache1_tag_mem_force_on : HRO; bitpos: [4]; default: 1;
         *  The bit is used to close clock gating of  L1-ICache1 tag memory. 1: close gating,
         *  0: open clock gating.
         */
        uint32_t l1_icache1_tag_mem_force_on:1;
        /** l1_icache1_tag_mem_force_pd : HRO; bitpos: [5]; default: 0;
         *  The bit is used to power L1-ICache1 tag memory down. 0: follow rtc_lslp, 1: power
         *  down
         */
        uint32_t l1_icache1_tag_mem_force_pd:1;
        /** l1_icache1_tag_mem_force_pu : HRO; bitpos: [6]; default: 1;
         *  The bit is used to power L1-ICache1 tag memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l1_icache1_tag_mem_force_pu:1;
        uint32_t reserved_7:1;
        /** l1_icache2_tag_mem_force_on : HRO; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_tag_mem_force_on:1;
        /** l1_icache2_tag_mem_force_pd : HRO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_tag_mem_force_pd:1;
        /** l1_icache2_tag_mem_force_pu : HRO; bitpos: [10]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_tag_mem_force_pu:1;
        uint32_t reserved_11:1;
        /** l1_icache3_tag_mem_force_on : HRO; bitpos: [12]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_tag_mem_force_on:1;
        /** l1_icache3_tag_mem_force_pd : HRO; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_tag_mem_force_pd:1;
        /** l1_icache3_tag_mem_force_pu : HRO; bitpos: [14]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_tag_mem_force_pu:1;
        uint32_t reserved_15:1;
        /** l1_cache_tag_mem_force_on : R/W; bitpos: [16]; default: 1;
         *  The bit is used to close clock gating of  L1-Cache tag memory. 1: close gating, 0:
         *  open clock gating.
         */
        uint32_t l1_cache_tag_mem_force_on:1;
        /** l1_cache_tag_mem_force_pd : R/W; bitpos: [17]; default: 0;
         *  The bit is used to power L1-Cache tag memory down. 0: follow rtc_lslp, 1: power down
         */
        uint32_t l1_cache_tag_mem_force_pd:1;
        /** l1_cache_tag_mem_force_pu : R/W; bitpos: [18]; default: 1;
         *  The bit is used to power L1-Cache tag memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l1_cache_tag_mem_force_pu:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} cache_l1_cache_tag_mem_power_ctrl_reg_t;

/** Type of l2_cache_tag_mem_power_ctrl register
 *  Cache tag memory power control register
 */
typedef union {
    struct {
        uint32_t reserved_0:20;
        /** l2_cache_tag_mem_force_on : HRO; bitpos: [20]; default: 0;
         *  The bit is used to close clock gating of  L2-Cache tag memory. 1: close gating, 0:
         *  open clock gating.
         */
        uint32_t l2_cache_tag_mem_force_on:1;
        /** l2_cache_tag_mem_force_pd : HRO; bitpos: [21]; default: 0;
         *  The bit is used to power L2-Cache tag memory down. 0: follow rtc_lslp, 1: power down
         */
        uint32_t l2_cache_tag_mem_force_pd:1;
        /** l2_cache_tag_mem_force_pu : HRO; bitpos: [22]; default: 0;
         *  The bit is used to power L2-Cache tag memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l2_cache_tag_mem_force_pu:1;
        uint32_t reserved_23:9;
    };
    uint32_t val;
} cache_l2_cache_tag_mem_power_ctrl_reg_t;


/** Group: Cache Data Memory Power Control registers */
/** Type of l1_cache_data_mem_power_ctrl register
 *  Cache data memory power control register
 */
typedef union {
    struct {
        /** l1_icache0_data_mem_force_on : HRO; bitpos: [0]; default: 1;
         *  The bit is used to close clock gating of  L1-ICache0 data memory. 1: close gating,
         *  0: open clock gating.
         */
        uint32_t l1_icache0_data_mem_force_on:1;
        /** l1_icache0_data_mem_force_pd : HRO; bitpos: [1]; default: 0;
         *  The bit is used to power L1-ICache0 data memory down. 0: follow rtc_lslp, 1: power
         *  down
         */
        uint32_t l1_icache0_data_mem_force_pd:1;
        /** l1_icache0_data_mem_force_pu : HRO; bitpos: [2]; default: 1;
         *  The bit is used to power L1-ICache0 data memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l1_icache0_data_mem_force_pu:1;
        uint32_t reserved_3:1;
        /** l1_icache1_data_mem_force_on : HRO; bitpos: [4]; default: 1;
         *  The bit is used to close clock gating of  L1-ICache1 data memory. 1: close gating,
         *  0: open clock gating.
         */
        uint32_t l1_icache1_data_mem_force_on:1;
        /** l1_icache1_data_mem_force_pd : HRO; bitpos: [5]; default: 0;
         *  The bit is used to power L1-ICache1 data memory down. 0: follow rtc_lslp, 1: power
         *  down
         */
        uint32_t l1_icache1_data_mem_force_pd:1;
        /** l1_icache1_data_mem_force_pu : HRO; bitpos: [6]; default: 1;
         *  The bit is used to power L1-ICache1 data memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l1_icache1_data_mem_force_pu:1;
        uint32_t reserved_7:1;
        /** l1_icache2_data_mem_force_on : HRO; bitpos: [8]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_data_mem_force_on:1;
        /** l1_icache2_data_mem_force_pd : HRO; bitpos: [9]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_data_mem_force_pd:1;
        /** l1_icache2_data_mem_force_pu : HRO; bitpos: [10]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache2_data_mem_force_pu:1;
        uint32_t reserved_11:1;
        /** l1_icache3_data_mem_force_on : HRO; bitpos: [12]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_data_mem_force_on:1;
        /** l1_icache3_data_mem_force_pd : HRO; bitpos: [13]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_data_mem_force_pd:1;
        /** l1_icache3_data_mem_force_pu : HRO; bitpos: [14]; default: 1;
         *  Reserved
         */
        uint32_t l1_icache3_data_mem_force_pu:1;
        uint32_t reserved_15:1;
        /** l1_cache_data_mem_force_on : R/W; bitpos: [16]; default: 1;
         *  The bit is used to close clock gating of  L1-Cache data memory. 1: close gating, 0:
         *  open clock gating.
         */
        uint32_t l1_cache_data_mem_force_on:1;
        /** l1_cache_data_mem_force_pd : R/W; bitpos: [17]; default: 0;
         *  The bit is used to power L1-Cache data memory down. 0: follow rtc_lslp, 1: power
         *  down
         */
        uint32_t l1_cache_data_mem_force_pd:1;
        /** l1_cache_data_mem_force_pu : R/W; bitpos: [18]; default: 1;
         *  The bit is used to power L1-Cache data memory up. 0: follow rtc_lslp, 1: power up
         */
        uint32_t l1_cache_data_mem_force_pu:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} cache_l1_cache_data_mem_power_ctrl_reg_t;

