espressif/esp-idf/components/soc/esp32h2/register/soc/cache_struct.h
/** Type of l1_bus1_acs_nxtlvl_cnt register
 *  L1-Cache bus1 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_bus1_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-Cache accesses L2-Cache due to
         *  bus1 accessing L1-Cache.
         */
        uint32_t l1_bus1_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l1_bus1_acs_nxtlvl_cnt_reg_t;

/** Type of l1_dbus2_acs_hit_cnt register
 *  L1-DCache bus2 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus2 accesses L1-DCache.
         */
        uint32_t l1_dbus2_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_hit_cnt_reg_t;

/** Type of l1_dbus2_acs_miss_cnt register
 *  L1-DCache bus2 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus2 accesses L1-DCache.
         */
        uint32_t l1_dbus2_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_miss_cnt_reg_t;

/** Type of l1_dbus2_acs_conflict_cnt register
 *  L1-DCache bus2 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus2 accesses L1-DCache.
         */
        uint32_t l1_dbus2_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_conflict_cnt_reg_t;

/** Type of l1_dbus2_acs_nxtlvl_cnt register
 *  L1-DCache bus2 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-DCache accesses L2-Cache due to
         *  bus2 accessing L1-DCache.
         */
        uint32_t l1_dbus2_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_nxtlvl_cnt_reg_t;

/** Type of l1_dbus3_acs_hit_cnt register
 *  L1-DCache bus3 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus3_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus3 accesses L1-DCache.
         */
        uint32_t l1_dbus3_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus3_acs_hit_cnt_reg_t;

/** Type of l1_dbus3_acs_miss_cnt register
 *  L1-DCache bus3 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus3_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus3 accesses L1-DCache.
         */
        uint32_t l1_dbus3_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus3_acs_miss_cnt_reg_t;

/** Type of l1_dbus3_acs_conflict_cnt register
 *  L1-DCache bus3 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus3_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus3 accesses L1-DCache.
         */
        uint32_t l1_dbus3_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus3_acs_conflict_cnt_reg_t;

/** Type of l1_dbus3_acs_nxtlvl_cnt register
 *  L1-DCache bus3 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus3_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-DCache accesses L2-Cache due to
         *  bus3 accessing L1-DCache.
         */
        uint32_t l1_dbus3_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus3_acs_nxtlvl_cnt_reg_t;

/** Type of l2_cache_acs_cnt_ctrl register
 *  Cache Access Counter enable and clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l2_ibus0_cnt_ena : HRO; bitpos: [8]; default: 0;
         *  The bit is used to enable ibus0 counter in L2-Cache.
         */
        uint32_t l2_ibus0_cnt_ena:1;
        /** l2_ibus1_cnt_ena : HRO; bitpos: [9]; default: 0;
         *  The bit is used to enable ibus1 counter in L2-Cache.
         */
        uint32_t l2_ibus1_cnt_ena:1;
        /** l2_ibus2_cnt_ena : HRO; bitpos: [10]; default: 0;
         *  Reserved
         */
        uint32_t l2_ibus2_cnt_ena:1;
        /** l2_ibus3_cnt_ena : HRO; bitpos: [11]; default: 0;
         *  Reserved
         */
        uint32_t l2_ibus3_cnt_ena:1;
        /** l2_dbus0_cnt_ena : HRO; bitpos: [12]; default: 0;
         *  The bit is used to enable dbus0 counter in L2-Cache.
         */
        uint32_t l2_dbus0_cnt_ena:1;
        /** l2_dbus1_cnt_ena : HRO; bitpos: [13]; default: 0;
         *  The bit is used to enable dbus1 counter in L2-Cache.
         */
        uint32_t l2_dbus1_cnt_ena:1;
        /** l2_dbus2_cnt_ena : HRO; bitpos: [14]; default: 0;
         *  Reserved
         */
        uint32_t l2_dbus2_cnt_ena:1;
        /** l2_dbus3_cnt_ena : HRO; bitpos: [15]; default: 0;
         *  Reserved
         */
        uint32_t l2_dbus3_cnt_ena:1;
        uint32_t reserved_16:8;
        /** l2_ibus0_cnt_clr : HRO; bitpos: [24]; default: 0;
         *  The bit is used to clear ibus0 counter in L2-Cache.
         */
        uint32_t l2_ibus0_cnt_clr:1;
        /** l2_ibus1_cnt_clr : HRO; bitpos: [25]; default: 0;
         *  The bit is used to clear ibus1 counter in L2-Cache.
         */
        uint32_t l2_ibus1_cnt_clr:1;
        /** l2_ibus2_cnt_clr : HRO; bitpos: [26]; default: 0;
         *  Reserved
         */
        uint32_t l2_ibus2_cnt_clr:1;
        /** l2_ibus3_cnt_clr : HRO; bitpos: [27]; default: 0;
         *  Reserved
         */
        uint32_t l2_ibus3_cnt_clr:1;
        /** l2_dbus0_cnt_clr : HRO; bitpos: [28]; default: 0;
         *  The bit is used to clear dbus0 counter in L2-Cache.
         */
        uint32_t l2_dbus0_cnt_clr:1;
        /** l2_dbus1_cnt_clr : HRO; bitpos: [29]; default: 0;
         *  The bit is used to clear dbus1 counter in L2-Cache.
         */
        uint32_t l2_dbus1_cnt_clr:1;
        /** l2_dbus2_cnt_clr : HRO; bitpos: [30]; default: 0;
         *  Reserved
         */
        uint32_t l2_dbus2_cnt_clr:1;
        /** l2_dbus3_cnt_clr : HRO; bitpos: [31]; default: 0;
         *  Reserved
         */
        uint32_t l2_dbus3_cnt_clr:1;
    };
    uint32_t val;
} cache_l2_cache_acs_cnt_ctrl_reg_t;

/** Type of l2_ibus0_acs_hit_cnt register
 *  L2-Cache bus0 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus0_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-ICache0 accesses L2-Cache due to
         *  bus0 accessing L1-ICache0.
         */
        uint32_t l2_ibus0_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus0_acs_hit_cnt_reg_t;

/** Type of l2_ibus0_acs_miss_cnt register
 *  L2-Cache bus0 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus0_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-ICache0 accesses L2-Cache due to
         *  bus0 accessing L1-ICache0.
         */
        uint32_t l2_ibus0_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus0_acs_miss_cnt_reg_t;

/** Type of l2_ibus0_acs_conflict_cnt register
 *  L2-Cache bus0 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus0_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-ICache0 accesses
         *  L2-Cache due to bus0 accessing L1-ICache0.
         */
        uint32_t l2_ibus0_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus0_acs_conflict_cnt_reg_t;

/** Type of l2_ibus0_acs_nxtlvl_cnt register
 *  L2-Cache bus0 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus0_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-ICache0 accessing L2-Cache due to bus0 accessing L1-ICache0.
         */
        uint32_t l2_ibus0_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus0_acs_nxtlvl_cnt_reg_t;

/** Type of l2_ibus1_acs_hit_cnt register
 *  L2-Cache bus1 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus1_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-ICache1 accesses L2-Cache due to
         *  bus1 accessing L1-ICache1.
         */
        uint32_t l2_ibus1_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus1_acs_hit_cnt_reg_t;

/** Type of l2_ibus1_acs_miss_cnt register
 *  L2-Cache bus1 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus1_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-ICache1 accesses L2-Cache due to
         *  bus1 accessing L1-ICache1.
         */
        uint32_t l2_ibus1_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus1_acs_miss_cnt_reg_t;

/** Type of l2_ibus1_acs_conflict_cnt register
 *  L2-Cache bus1 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus1_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-ICache1 accesses
         *  L2-Cache due to bus1 accessing L1-ICache1.
         */
        uint32_t l2_ibus1_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus1_acs_conflict_cnt_reg_t;

/** Type of l2_ibus1_acs_nxtlvl_cnt register
 *  L2-Cache bus1 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus1_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-ICache1 accessing L2-Cache due to bus1 accessing L1-ICache1.
         */
        uint32_t l2_ibus1_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus1_acs_nxtlvl_cnt_reg_t;

/** Type of l2_ibus2_acs_hit_cnt register
 *  L2-Cache bus2 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-ICache2 accesses L2-Cache due to
         *  bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_hit_cnt_reg_t;

/** Type of l2_ibus2_acs_miss_cnt register
 *  L2-Cache bus2 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-ICache2 accesses L2-Cache due to
         *  bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_miss_cnt_reg_t;

/** Type of l2_ibus2_acs_conflict_cnt register
 *  L2-Cache bus2 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-ICache2 accesses
         *  L2-Cache due to bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_conflict_cnt_reg_t;

/** Type of l2_ibus2_acs_nxtlvl_cnt register
 *  L2-Cache bus2 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus2_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-ICache2 accessing L2-Cache due to bus2 accessing L1-ICache2.
         */
        uint32_t l2_ibus2_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus2_acs_nxtlvl_cnt_reg_t;

/** Type of l2_ibus3_acs_hit_cnt register
 *  L2-Cache bus3 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-ICache3 accesses L2-Cache due to
         *  bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_hit_cnt_reg_t;

/** Type of l2_ibus3_acs_miss_cnt register
 *  L2-Cache bus3 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-ICache3 accesses L2-Cache due to
         *  bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_miss_cnt_reg_t;

