espressif/esp-idf/components/soc/esp32h2/register/soc/cache_struct.h
/** Type of l2_ibus3_acs_conflict_cnt register
 *  L2-Cache bus3 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-ICache3 accesses
         *  L2-Cache due to bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_conflict_cnt_reg_t;

/** Type of l2_ibus3_acs_nxtlvl_cnt register
 *  L2-Cache bus3 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_ibus3_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-ICache3 accessing L2-Cache due to bus3 accessing L1-ICache3.
         */
        uint32_t l2_ibus3_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_ibus3_acs_nxtlvl_cnt_reg_t;

/** Type of l2_dbus0_acs_hit_cnt register
 *  L2-Cache bus0 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-DCache accesses L2-Cache due to
         *  bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_hit_cnt_reg_t;

/** Type of l2_dbus0_acs_miss_cnt register
 *  L2-Cache bus0 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-DCache accesses L2-Cache due to
         *  bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_miss_cnt_reg_t;

/** Type of l2_dbus0_acs_conflict_cnt register
 *  L2-Cache bus0 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-DCache accesses
         *  L2-Cache due to bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_conflict_cnt_reg_t;

/** Type of l2_dbus0_acs_nxtlvl_cnt register
 *  L2-Cache bus0 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus0_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-DCache accessing L2-Cache due to bus0 accessing L1-DCache.
         */
        uint32_t l2_dbus0_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus0_acs_nxtlvl_cnt_reg_t;

/** Type of l2_dbus1_acs_hit_cnt register
 *  L2-Cache bus1 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus1_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-DCache accesses L2-Cache due to
         *  bus1 accessing L1-DCache.
         */
        uint32_t l2_dbus1_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus1_acs_hit_cnt_reg_t;

/** Type of l2_dbus1_acs_miss_cnt register
 *  L2-Cache bus1 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus1_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-DCache accesses L2-Cache due to
         *  bus1 accessing L1-DCache.
         */
        uint32_t l2_dbus1_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus1_acs_miss_cnt_reg_t;

/** Type of l2_dbus1_acs_conflict_cnt register
 *  L2-Cache bus1 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus1_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-DCache accesses
         *  L2-Cache due to bus1 accessing L1-DCache.
         */
        uint32_t l2_dbus1_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus1_acs_conflict_cnt_reg_t;

/** Type of l2_dbus1_acs_nxtlvl_cnt register
 *  L2-Cache bus1 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus1_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-DCache accessing L2-Cache due to bus1 accessing L1-DCache.
         */
        uint32_t l2_dbus1_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus1_acs_nxtlvl_cnt_reg_t;

/** Type of l2_dbus2_acs_hit_cnt register
 *  L2-Cache bus2 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus2_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-DCache accesses L2-Cache due to
         *  bus2 accessing L1-DCache.
         */
        uint32_t l2_dbus2_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus2_acs_hit_cnt_reg_t;

/** Type of l2_dbus2_acs_miss_cnt register
 *  L2-Cache bus2 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus2_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-DCache accesses L2-Cache due to
         *  bus2 accessing L1-DCache.
         */
        uint32_t l2_dbus2_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus2_acs_miss_cnt_reg_t;

/** Type of l2_dbus2_acs_conflict_cnt register
 *  L2-Cache bus2 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus2_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-DCache accesses
         *  L2-Cache due to bus2 accessing L1-DCache.
         */
        uint32_t l2_dbus2_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus2_acs_conflict_cnt_reg_t;

/** Type of l2_dbus2_acs_nxtlvl_cnt register
 *  L2-Cache bus2 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus2_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-DCache accessing L2-Cache due to bus2 accessing L1-DCache.
         */
        uint32_t l2_dbus2_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus2_acs_nxtlvl_cnt_reg_t;

/** Type of l2_dbus3_acs_hit_cnt register
 *  L2-Cache bus3 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus3_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when L1-DCache accesses L2-Cache due to
         *  bus3 accessing L1-DCache.
         */
        uint32_t l2_dbus3_hit_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus3_acs_hit_cnt_reg_t;

/** Type of l2_dbus3_acs_miss_cnt register
 *  L2-Cache bus3 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus3_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when L1-DCache accesses L2-Cache due to
         *  bus3 accessing L1-DCache.
         */
        uint32_t l2_dbus3_miss_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus3_acs_miss_cnt_reg_t;

/** Type of l2_dbus3_acs_conflict_cnt register
 *  L2-Cache bus3 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus3_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when L1-DCache accesses
         *  L2-Cache due to bus3 accessing L1-DCache.
         */
        uint32_t l2_dbus3_conflict_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus3_acs_conflict_cnt_reg_t;

/** Type of l2_dbus3_acs_nxtlvl_cnt register
 *  L2-Cache bus3 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l2_dbus3_nxtlvl_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L2-Cache accesses external memory due
         *  to L1-DCache accessing L2-Cache due to bus3 accessing L1-DCache.
         */
        uint32_t l2_dbus3_nxtlvl_cnt:32;
    };
    uint32_t val;
} cache_l2_dbus3_acs_nxtlvl_cnt_reg_t;


/** Group: Access Fail Debug registers */
/** Type of l1_icache0_acs_fail_id_attr register
 *  L1-ICache0 Access Fail ID/attribution information register
 */
typedef union {
    struct {
        /** l1_icache0_fail_id : RO; bitpos: [15:0]; default: 0;
         *  The register records the ID of fail-access when cache0 accesses L1-ICache.
         */
        uint32_t l1_icache0_fail_id:16;
        /** l1_icache0_fail_attr : RO; bitpos: [31:16]; default: 0;
         *  The register records the attribution of fail-access when cache0 accesses L1-ICache.
         */
        uint32_t l1_icache0_fail_attr:16;
    };
    uint32_t val;
} cache_l1_icache0_acs_fail_id_attr_reg_t;

